---
kind: other
id: Methods.T:Autodesk.Revit.DB.DirectContext3D.IndexTriangle
source: html/25a51ead-580f-6b71-ef68-42b07aa9013d.htm
---
# IndexTriangle Methods

Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.